
#######################################
#
#        IOBasic
#        기본 입출력 함수
#
#######################################

# 출력함수 : print()
# 콘솔창에 데이터를 출력해주는 함수

# , 를 이용한 출력 : ,로 구분하여 공백(' ')을 삽입하여 출력


print("")
# %연산자를 이용한 출력 : 문자열에 %연산자를 이용하여 형식에 맞는 데이터 삽입하여 출력
# print("가격은 %d 원" % 10) 콤마 찍지 않고 작성

print("")
# format() 함수를 이용한 출력 : 인수로 데이터를 전달하고,
# 해당 값이 표시될 위치를 중괄호({})로 표시하여 중괄호에 데이터를 삽입하여 출력
# print("사과의 가격은 {}원 이고, 배의 가격은 {}원 입니다.".format(3000, 6000))
# print("사과의 가격은 {1}원 이고, 배의 가격은 {0}원 입니다.".format(3000, 6000))

# print("")
# # f-string을 이용한 출력 : 문자열에 중괄호({})를 표시하고 중괄호 안에 출력할 데이터를 넣어 출력
# print(f"사과의 가격은 {5000}원 이고, 배의 가격은 {3000}원 입니다.")

# print("")
# # print() 함수의 키워드
# # sep : 출력되는 각 항목 사이에 들어간 문자열을 정의해 줌
# print(f"사과의 가격은 {5000}원 이고, 배의 가격은 {3000}원 입니다.",
#       "사과의 가격은 {5000}원 이고, 배의 가격은 {3000}원 입니다.", sep=" /")


print("")
# end : 출력되는 내용의 마지막에 들어갈 문자열을 정의해 줌
# print(f"사과의 가격은 {5000}원 이고, 배의 가격은 {3000}원 입니다."
#       "사과의 가격은 {5000}원 이고, 배의 가격은 {3000}원 입니다", end=".")

print("")
# 입력함수 : input()
# 키보드로 콘솔창에서 입력을 받아오는 함수
# date = input("오늘 날짜는 : ")
# print(date)


print("")
# input() 함수를 사용해 입력받은 데이터는 모두 문자열 데이터로 취급됨
# input() 함수로 입력받은 데이터를 사용하기 전에는 형변환 필수!

# print("0과 10사이의 수를 적으시오 : ", end=(""))
# a = int(input())

