
#######################################
#
#        while Loop
#        while 반복문
#
#######################################

# while (조건부 반복문)
#
# 반복해야 할 횟수가 정해져 있지 않을 때 사용
# 조건이 참인 동안 반복
#
# while 조건:
#     반복할 문장



print("")
# while 문 예제 1
# 두 정수 n1, n2 를 입력받고 n1 <= a < n2 에 해당하는 a의 합을 출력하시오.



print("")
# while 문 예제 2
# 두 정수 n1, n2 를 입력 받고 n1 <= a < n2 에 해당하는 a의 값 중 6의 배수의 합을 출력하시오.



print("")
# while 문 예제 3
# 하이푼(-)을 포함한 전화번호를 입력받고 하이푼을 제외한 숫자들만 출력하시오.



print("")
# while 문 예제 4
# 연/월/일(ex : 2021/09/01)을 입력받고 /를 제외한 숫자들만 출력하시오.



print("")
# while 문 예제 5
# 구구단 2단을 출력하시오.
# 출력형태
# 2 * 1 = 2
# 2 * 2 = 4
# ...
# 2 * 9 = 18



print("")
# while 문 예제 6
# 구구단 3단을 출력하시오.
# 출력형태
# 3 * 1 = 3
# 3 * 2 = 6
# ...
# 3 * 9 = 27



print("")
# while 문 예제 7
# 구구단을 2단부터 9단까지 출력하시오.
# 출력형태는 위와 동일



print("")
# while 문 예제 8
# * 출력으로 삼각형을 만드시오.
# 출력형태
# *
# **
# ***
# ...
# **********

